(ns clojure-for-the-brave.Chapter-7)

;---------------------------------------------------------------------------------------------------------------
; Exercise 1
;---------------------------------------------------------------------------------------------------------------

(eval '(list "Vinícius Diori" "Duna"))

(eval (list 'str "Vinícius Diori" "Duna"))

(eval (read-string "(list \"Vinícius Diori\" \"Duna\")"))

;---------------------------------------------------------------------------------------------------------------
; Exercise 2
;---------------------------------------------------------------------------------------------------------------
(defmacro infix
  [[op1 plus op2 times op3 minus op4]]
  (list minus
        (list plus op1
              (list times op2 op3))
        op4))

(println (infix (1 + 3 * 4 - 5)))

(println (macroexpand '(infix (1 + 3 * 4 - 5))))